Product - AIM/archive/v1/sample messages/body-aim-returnprepop-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/Prepop</wsa:Action>
    </soap:Header>
    <soap:Body>
        <ret:Prepop xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnPrepopRequestMsg>
                <prep:PrepopRequestWrapper xmlns:prep="https://services.ird.govt.nz/GWS/Returns/:types/PrepopRequest">
                    <ret1:retrieveFormInfoRequest xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1">
                        <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
                            <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                            <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                            <com:softwareRelease>1.0</com:softwareRelease>
                        </com:softwareProviderData>
                        <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1" IdentifierValueType="ACCIRD">123090918</com:identifier>
                        <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">INC</com:accountType>
                        <ret1:periodEndDate>2019-03-31</ret1:periodEndDate>
                        <ret1:majorFormType>SOA</ret1:majorFormType>
                    </ret1:retrieveFormInfoRequest>
                </prep:PrepopRequestWrapper>
            </ret:ReturnPrepopRequestMsg>
        </ret:Prepop>
    </soap:Body>
</soap:Envelope>